bench/results/go-nethttp-chi/v3-20260526-201743-go-nethttp-chi/read-c200.txt
Running 30s test @ http://localhost:3005
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.71ms    2.21ms  57.98ms   75.71%
    Req/Sec     3.76k   648.54     5.69k    68.04%
  897434 requests in 30.01s, 121.53MB read
  Non-2xx or 3xx responses: 897434
Requests/sec:  29901.18
Transfer/sec:      4.05MB